# -*- coding: utf-8 -*-


import unittest
from unittest import TestCase

from config import default_answer_number
from core.baiduzhidao import zhidao_search
from core.textsummary import get_summary


class OcrTestCase(TestCase):
    """unittest"""

    def test_baidu_ocr(self):
        """
        test baidu ocr

        :return:
        """
        from core.ocr.baiduocr import get_text_from_image

        print("test baidu ocr")
        app_id = "10661627"
        app_key = "h5xcL0m4TB8fiiFWoysn7uxt"
        app_secret = "HGA1cgXzz80douKQUpII7K77TYWSGcfW"

        with open("screenshots/text_area.png", "rb") as fp:
            message = get_text_from_image(fp.read(), app_id, app_key, app_secret, 5)
            answers = zhidao_search(
                keyword=message,
                default_answer_select=default_answer_number,
                timeout=5
            )
            answers = filter(None, answers)
            print("".join(answers))

    def test_get_summary(self):
        txt = get_summary(
            "　，隋唐时期，‍科举制度是中国历史上考试选拔官员的一种基本制度.他渊源于汉朝,创始于隋朝,"
            "确立于唐朝,完备于宋朝,兴盛于明、清两朝,废除于清朝末年,历经唐、宋、元、明、清.根据史书记载,"
            "从隋朝大业元年（6O5）的进士科算起到；光绪三十一年（1905）正式废除,整整绵延存在了1300周年,"
            "在国内外有着广泛而深远的影响.从中国的官制史上看,科举制度的产生是历史的必然和巨大进步,也有人"
            "认为是一次深刻的革命.在中国历史上,奴隶主阶级和封建地主阶级为了巩固自己的统治曾采用过各种方式,"
            "建立过各种官吏制度选拔其所需要的人才.夏、商、周采用的是“分封制”和“世卿世禄制”,均为血缘世袭关系,"
            "难以得其优秀人才,其结果是“龙生龙,凤生风”老百姓的儿子“面朝黄土背朝天”.汉朝的“察举”和“征辟”制替代"
            "了世袭制,由州、郡地方长官向朝廷举荐人才,经朝廷考察后授其官位,或由皇帝特诏选任官吏,这自然是一个"
            "进步.但仍是地方长官的意志和朝廷的意愿,人为因素很大.由于掌握选官大权的官僚们注重门第,官官相护,"
            "朋比为奸,徇私舞弊,出现的严重问题是：“举秀才,不知书；举孝廉,父别居.寒素清白浊如泥,高第良将怯如鸡”."
            " 出身底层的好人才还是不能被选拔上来.魏晋南北朝实行的是“九品中正制”.由政府选派有声望的官员到州、"
            "郡任大小中正,品评一些地主阶级知识分子等第.各州大中正,各郡中正官将其所管辖的地区的人才品德和家世"
            "定位九品（上上、上中、上下；中上、中中、中下；下上、下中、下下）以推荐给朝廷,任用官职.这在当时多"
            "少改变了州、郡地方长官随意左右,为所欲为,受贿营私的状况,到是选拔出了一些比较有才能的人进入仕途.但"
            "是,中正官到后来却完全被世家大族所把持,“九品访人,唯问中正”,实际上已成为大地主、豪族势力控制选官的"
            "工具.家世、门第成为评定官品的唯一标准.从而出现了“公门有公,卿门有卿”和“上品无寒门,下品无势族,、“世"
            "胄蹑高位,英俊沉下僚”的局面,中小地主只能做些小官,平民百姓均被拒之官场之外. 从隋朝至明清的科举制度,"
            "它所一直坚持的是“自由报名,统一考试,平等竞争,择优录取,公开张榜”的原则,彻底打破了血缘世袭关系和世族的"
            "垄断,对我国古代社会的选官制度,特别是对汉代的察举和征辟制,魏晋南北朝的九品中正制是一个直接有力的改革"
            "和否定.给中小地主阶级和平民百姓通过科举入仕提供了一个公平竞争的平台、机会和条件,使大批地位低下和出身"
            "寒微的优秀人才脱颖而出,“朝为田舍郎,暮登天子堂”,“十年寒窗无人问,一举成名天下知”.他们—一登上历史的政"
            "治舞台,成为统治阶级的栋梁之才.北宋的吕蒙正自幼遭不幸,被其父将母子二人赶出家门长期居住在一个山洞里过"
            "着饥寒生活,他则发奋读书而高中状元,极善理政治国,成为宋初名相.范仲淹自幼家贫,进土及第后官至宰相,大有"
            "作为,享有“朝廷无忧有范君,京师无事有希文”（范仲淹字希文）的盛誉.南宋状元文天祥的先祖未曾做过一官．"
            "父亲只是一个普通读书人,一家人长期身居低层,他入仕后,丹心报国,壮烈就义,成为千古传颂的民族英雄.清代乾"
            "隆年间的陕西状元王杰和清末最后一名状元刘春霖都是地地道道的农家子弟,父母都是种田人.王杰在朝为官40余"
            "年,身为嘉庆帝师,官居高位,刚正廉洁,一尘不染,伸张正义,最恨邪恶.嘉庆皇帝惩办贪官和绅时,王杰是主审官.王"
            "杰是后世公认的乾、嘉两代名臣.王杰晚年告老还乡,嘉庆皇帝对他的称赞是：“直道一身立庙廊,两袖清风返寒城”"
            ".倘若没有科举制度,这些布衣草民们是根本不可能登上龙门,身居高位的,永远没有出头之日. 在漫长的1300年的"
            "科举制度中,曾产生出700多名状元,近11万名进士,数百万名举人.隋唐以后,几乎每一位知识分子都与科举考试有"
            "着不解之缘,都有过科举生涯,从未参加过科举考试的是极少数.科举产生出了一大批善于治国安邦的名臣、名相和"
            "雄才大略的政治家、众多有杰出贡献的思想家、文学家、艺术家、诗人、学者、教育家、科学家、外交家等等,如"
            "唐代的孙伏伽、王维、张九龄、韩愈、柳宗元、刘禹锡、颜真卿、柳公权、白居易,宋代的欧阳修、王安石、苏东"
            "坡、司马光、朱熹、包拯、寇准、张九成、张孝祥,明代的杨慎、康海、汤显祖、张居正、海瑞、徐光启,清代的纪"
            "晓岚、刘墉、郑板桥、翁同和、洪钧、钱大听、林则徐、张謇、蔡元培等文化名人都是出自状元、进土和举人之"
            "中,都是中华民族的英才. 1300年的科举制度几乎占据了中国两千多年封建社会五分之三和中国五千年"
            "文明史的近三分之一的时间,历史之长,影响之大,家喻户晓,妇孺皆知.它对于祖国的统一、社会的稳定、"
            "各民族的团结和融合,对于中华文明的传播和建设,特别是对儒家文化和古代教育的促进和发展都曾产生"
            "过巨大作用.我国的科举制度从宋元以后东渐西传,越南、日本、韩国、朝鲜,在其国内都较长时间仿照中"
            "国推行过科举制度；法国、美国、英国等国家的选拔官吏的政治制度也都直接受到中国科举制度的作用"
            "和重要影响.西方现代的文官选拔制度、我国现代的教育制度和干部选拔制度都是中国科举制度的继承和"
            "发展.因此,孙中山先生曾充分肯定中国的科举制度“是世界各国中所用以拔取真才之最古最好的制度”（"
            "《五权宪法》）.西方人将中国的科举制度称之为“中国第五大发明”.它无疑对中华民族,对全人类都是"
            "一个了不起的贡献. 中国的科举考试内容到明代以八股文为主,即“八股取仕”.它逐步成为僵化模式,特"
            "别是到晚清时成为严重束缚知识分子的枷锁,暴露出种种弊端.因此,吴敬梓才写出了《儒林外史》这部讽"
            "刺科场的不朽名著.到清朝末年,在封建社会制度行将灭亡之际,发生了戊戌变法,“废除科举,兴办学堂,”"
            "已成为历史的必然.1905年清政府颁布了停止科举的上谕.从此,1300年的科举制度宣告结束.",
            sentences=4)
        print(txt)


if __name__ == "__main__":
    unittest.main()
